243-510-MA/243-510-A17/MIWI 2.0/Lib/apps/miwi/miwi_mesh/MiWi_Mesh/mesh_example_16bit/src/system_config/exp16_pic24f128ga010_24j40/system.c
#include <xc.h>
#include <stdint.h>
#include <stdbool.h>
#ifdef __PIC32MX__
    #include <plib.h>
#endif
#include "miwi_config.h"
#include "system.h"

#include "symbol.h"
#ifdef __PIC32MX__
    #if defined(_COORD) && !defined(USE_RFD_HW)
        #pragma config JTAGEN = OFF

        // USERID = No Setting
        #pragma config PMDL1WAY = OFF           // Peripheral Module Disable Configuration (Allow multiple reconfigurations)
        #pragma config IOL1WAY = OFF            // Peripheral Pin Select Configuration (Allow multiple reconfigurations)
        #pragma config FUSBIDIO = OFF           // USB USID Selection (Controlled by Port Function)
        #pragma config FVBUSONIO = OFF          // USB VBUS ON Selection (Controlled by Port Function)

        // DEVCFG2

        #pragma config FPLLIDIV = DIV_1         // PLL Input Divider (3x Divider)
        #pragma config OSCIOFNC = OFF           // CLKO Output Signal Active on the OSCO Pin (Disabled)
        #pragma config UPLLIDIV = DIV_1         // USB PLL Input Divider (3x Divider)

        #pragma config FPLLMUL = MUL_24         // PLL Multiplier (24x Multiplier)
        #pragma config UPLLEN = ON              // USB PLL Enable (Enabled)
        #pragma config FPLLODIV = DIV_2         // System PLL Output Clock Divider (PLL Divide by 2)

        // DEVCFG1
        #pragma config FNOSC = PRIPLL //FRCPLL   //PRIPLL           // Oscillator Selection Bits (Primary Osc w/PLL (XT+,HS+,EC+PLL))
        #pragma config FSOSCEN = OFF            // Secondary Oscillator Enable (Disabled)
        #pragma config IESO = OFF               // Internal/External Switch Over (Disabled)
        #pragma config POSCMOD = EC             // Primary Oscillator Configuration (XT osc mode)

        #pragma config FPBDIV = DIV_1           // Peripheral Clock Divisor (Pb_Clk is Sys_Clk/1)
        #pragma config FCKSM = CSDCMD           // Clock Switching and Monitor Selection (Clock Switch Disable, FSCM Disabled)
        #pragma config WDTPS = PS1              // Watchdog Timer Postscaler (1:1)
        #pragma config WINDIS = OFF             // Watchdog Timer Window Enable (Watchdog Timer is in Non-Window Mode)
        #pragma config FWDTEN = OFF             // Watchdog Timer Enable (WDT Disabled (SWDTEN Bit Controls))
        //#pragma config FWDTWINSZ = WISZ_25      // Watchdog Timer Window Size (Window Size is 25%)

        // DEVCFG0
        #pragma config ICESEL = ICS_PGx1        // ICE/ICD Comm Channel Select (Communicate on PGEC2/PGED2)
        #pragma config PWP = OFF                // Program Flash Write Protect (Disable)
        #pragma config BWP = OFF                // Boot Flash Write Protect bit (Protection Disabled)
        #pragma config CP = ON
    #else

        #pragma config JTAGEN = OFF

        // USERID = No Setting
        #pragma config PMDL1WAY = OFF           // Peripheral Module Disable Configuration (Allow multiple reconfigurations)
        #pragma config IOL1WAY = OFF            // Peripheral Pin Select Configuration (Allow multiple reconfigurations)
        #pragma config FUSBIDIO = OFF           // USB USID Selection (Controlled by Port Function)
        #pragma config FVBUSONIO = OFF          // USB VBUS ON Selection (Controlled by Port Function)

        // DEVCFG2

        #pragma config FPLLIDIV = DIV_2         // PLL Input Divider (3x Divider)
        #pragma config OSCIOFNC = OFF           // CLKO Output Signal Active on the OSCO Pin (Disabled)
        #pragma config UPLLIDIV = DIV_2         // USB PLL Input Divider (3x Divider)

        #pragma config FPLLMUL = MUL_24         // PLL Multiplier (24x Multiplier)
        #pragma config UPLLEN = ON              // USB PLL Enable (Enabled)
        #pragma config FPLLODIV = DIV_2         // System PLL Output Clock Divider (PLL Divide by 2)

        // DEVCFG1
        #pragma config FNOSC = FRCPLL   //PRIPLL           // Oscillator Selection Bits (Primary Osc w/PLL (XT+,HS+,EC+PLL))
        #pragma config FSOSCEN = OFF            // Secondary Oscillator Enable (Disabled)
        #pragma config IESO = OFF               // Internal/External Switch Over (Disabled)
        #pragma config POSCMOD = OFF             // Primary Oscillator Configuration (XT osc mode)

        #pragma config FPBDIV = DIV_1           // Peripheral Clock Divisor (Pb_Clk is Sys_Clk/1)
        #pragma config FCKSM = CSDCMD           // Clock Switching and Monitor Selection (Clock Switch Disable, FSCM Disabled)
        #pragma config WDTPS = PS1              // Watchdog Timer Postscaler (1:1)
        #pragma config WINDIS = OFF             // Watchdog Timer Window Enable (Watchdog Timer is in Non-Window Mode)
        #pragma config FWDTEN = OFF             // Watchdog Timer Enable (WDT Disabled (SWDTEN Bit Controls))
        //#pragma config FWDTWINSZ = WISZ_25      // Watchdog Timer Window Size (Window Size is 25%)

        // DEVCFG0
        #pragma config ICESEL = ICS_PGx1        // ICE/ICD Comm Channel Select (Communicate on PGEC2/PGED2)
        #pragma config PWP = OFF                // Program Flash Write Protect (Disable)
        #pragma config BWP = OFF                // Boot Flash Write Protect bit (Protection Disabled)
       // #pragma config CP = ON
    #endif
#elif defined(__PIC24F__)
    // CONFIG2
    #pragma config POSCMOD = XT             // Primary Oscillator Select (XT Oscillator mode selected)
    #pragma config OSCIOFNC = OFF           // Primary Oscillator Output Function (OSC2/CLKO/RC15 functions as CLKO (FOSC/2))
    #pragma config FCKSM = CSDCMD           // Clock Switching and Monitor (Clock switching and Fail-Safe Clock Monitor are disabled)
    #pragma config FNOSC = PRIPLL           // Oscillator Select (Primary Oscillator with PLL module (HSPLL, ECPLL))
    #pragma config IESO = ON                // Internal External Switch Over Mode (IESO mode (Two-Speed Start-up) enabled)

    // CONFIG1
    #pragma config WDTPS = PS1024           // Watchdog Timer Postscaler (1:1,024)
    #pragma config FWPSA = PR128            // WDT Prescaler (Prescaler ratio of 1:128)
    #pragma config WINDIS = ON              // Watchdog Timer Window (Standard Watchdog Timer enabled,(Windowed-mode is disabled))
    #pragma config FWDTEN = OFF             // Watchdog Timer Enable (Watchdog Timer is disabled)
    #pragma config ICS = PGx2               // Comm Channel Select (Emulator/debugger uses EMUC2/EMUD2)
    #pragma config GWRP = OFF               // General Code Segment Write Protect (Writes to program memory are allowed)
    #pragma config GCP = OFF                // General Code Segment Code Protect (Code protection is disabled)
    #pragma config JTAGEN = OFF             // JTAG Port Enable (JTAG port is disabled)
#else
    // CONFIG1L
    #pragma config WDTEN = OFF       // Watchdog Timer (Enabled)
    #pragma config PLLDIV = 2       // PLL Prescaler Selection bits (No prescale (4 MHz oscillator input drives PLL directly))
    #pragma config STVREN = ON      // Stack Overflow/Underflow Reset (Enabled)
    #pragma config XINST = OFF      // Extended Instruction Set (Disabled)

    // CONFIG1H
    #pragma config CPUDIV = OSC1    // CPU System Clock Postscaler (No CPU system clock divide)
    #pragma config CP0 = OFF        // Code Protect (Program memory is not code-protected)

