243-510-MA/243-510-A17/MIWI 2.0/Lib/apps/miwi/miwi_mesh/MiWi_Mesh/mesh_example_16bit/src/system_config/exp16_pic24f128ga010_24j40/system.c
    // CONFIG2L
    #pragma config OSC = INTOSCPLL  // Oscillator (INTOSCPLL)
    #pragma config T1DIG = ON       // T1OSCEN Enforcement (Secondary Oscillator clock source may be selected)
    #pragma config LPT1OSC = OFF    // Low-Power Timer1 Oscillator (High-power operation)
    #pragma config FCMEN = ON       // Fail-Safe Clock Monitor (Enabled)
    #pragma config IESO = ON        // Internal External Oscillator Switch Over Mode (Enabled)

    // CONFIG2H
    #pragma config WDTPS = 32768    // Watchdog Postscaler (1:32768)

    // CONFIG3L
    #pragma config DSWDTOSC = INTOSCREF// DSWDT Clock Select (DSWDT uses INTRC)
    #pragma config RTCOSC = INTOSCREF// RTCC Clock Select (RTCC uses INTRC)
    #pragma config DSBOREN = ON     // Deep Sleep BOR (Enabled)
    #pragma config DSWDTEN = ON     // Deep Sleep Watchdog Timer (Enabled)
    #pragma config DSWDTPS = G2     // Deep Sleep Watchdog Postscaler (1:2,147,483,648 (25.7 days))

    // CONFIG3H
    #pragma config IOL1WAY = OFF    // IOLOCK One-Way Set Enable bit (The IOLOCK bit (PPSCON<0>) can be set and cleared as needed)
    #pragma config MSSP7B_EN = MSK7 // MSSP address masking (7 Bit address masking mode)

    // CONFIG4L
    #pragma config WPFP = PAGE_63   // Write/Erase Protect Page Start/End Location (Write Protect Program Flash Page 63)
    #pragma config WPEND = PAGE_WPFP// Write/Erase Protect Region Select (valid when WPDIS = 0) (Page WPFP<5:0> through Configuration Words erase/write protected)
    #pragma config WPCFG = OFF      // Write/Erase Protect Configuration Region (Configuration Words page not erase/write-protected)

    // CONFIG4H
    #pragma config WPDIS = OFF      // Write Protect Disable bit (WPFP<5:0>/WPEND region ignored)


#endif

//uint16_t savedSPIBRG=0;

#ifdef __PIC32MX__

void HardwareInit(void)
{
    
    SYSTEMConfigWaitStatesAndPB ( SYSTEM_GetSystemClock ());
    CheKseg0CacheOn ();
    ANSELA=0;
    ANSELB=0;

    SDI2Rbits.SDI2R=3;//RPB13
    RPB2Rbits.RPB2R=4;//SDO2
#if defined(_COORD) && !defined(USE_RFD_HW)
    //Had to reroute the INT line to RPA3 (INT1)
    INT1Rbits.INT1R=0;//INT1 to RPA3
#else
    INT2Rbits.INT2R=0;//INT2 to RPA2
#endif
    Data_nCS = 1;
    Config_nCS = 1;

    Data_nCS_TRIS = 0;
    Config_nCS_TRIS = 0;

    IRQ0_INT_TRIS = 1;
    IRQ1_INT_TRIS = 1;

    //PHY_IRQ0 = 0;           // MRF89XA
    //PHY_IRQ0_En = 1;        // MRF89XA
    PHY_IRQ1 = 0;           // MRF89XA
    PHY_IRQ1_En = 1;        // MRF89XA
    /*******************************************************************/
    // Confiure SPI1
    /*******************************************************************/
    SDI_TRIS = 1;
    SDO_TRIS = 0;
    SCK_TRIS = 0;

    PHY_RESETn = 1;
    PHY_RESETn_TRIS = 0;

    DelayMs(100);

    PHY_RESETn=0;

    DelayMs(100);

#if defined(_COORD) && !defined(USE_RFD_HW)
    INTClearFlag(INT_INT1);
    ConfigINT1(EXT_INT_PRI_5 | RISING_EDGE_INT | EXT_INT_DISABLE);
#else
    INTClearFlag(INT_INT2);
    ConfigINT2(EXT_INT_PRI_5 | RISING_EDGE_INT | EXT_INT_DISABLE);
#endif
    OpenTimer1(T1_ON | T1_PS_1_1 | T1_SOURCE_INT, SetPeriodMS(1));
    ConfigIntTimer1(T1_INT_ON | T1_INT_PRIOR_4 | T1_INT_SUB_PRIOR_2);

    SpiChnOpen(SPI_CHANNEL2, SPI_OPEN_MSTEN | SPI_OPEN_CKE_REV | SPI_OPEN_ON, 4);
    SpiChnSetBitRate(SPI_CHANNEL2, SYSTEM_GetPeripheralClock(), 1000000);

    INTEnableSystemMultiVectoredInt ();


    LED0_TRIS=0;
    LED1_TRIS=0;

}

void __ISR(_TIMER_1_VECTOR, ipl4auto) T1Interrupt ( void)
{
    
    INTClearFlag(INT_T1);
}
uint32_t savedSPIBRG;
void HardwareSaveSPIBaudSetValue(uint32_t baud)
{
    savedSPIBRG=SPI2BRG;
    SpiChnSetBitRate(SPI_CHANNEL2, SYSTEM_GetPeripheralClock(), baud);
}

void HardwareRestoreSPIBaud(void)
{
    if(savedSPIBRG!=0)
    {
        SPI2BRG=savedSPIBRG;
        savedSPIBRG=0;
    }
}

void ButtonTask(void)
{

}

bool isButtonPressed(uint8_t index)
{
    return(false);
}
#elif defined(__PIC24F__)

void HardwareInit(void)
{
        
        // Make RB0 as Digital input
        AD1PCFGbits.PCFG2 = 1;
        
        // set I/O ports
        /*BUTTON_1_TRIS = 1;
        BUTTON_2_TRIS = 1;
        LED_1_TRIS = 0;
        LED_2_TRIS = 0;*/
        
        SW0_TRIS=1;
        SW1_TRIS=1;
        LED0_TRIS=0;
        LED1_TRIS=0;
        
        
        #if defined(MRF24J40) || defined(MRF49XA)
            PHY_CS_TRIS = 0;
            PHY_CS = 1;
            PHY_RESETn_TRIS = 0;
            PHY_RESETn = 1;
        #endif

        RF_INT_TRIS = 1;
        
        MAC_nCS_TRIS = 0;
        MAC_nCS = 1;
        
        SDI_TRIS = 1;
        SDO_TRIS = 0;
        SCK_TRIS = 0;
        SPI_SDO = 0;        
        SPI_SCK = 0;             
        
        #if defined(MRF49XA)
            nFSEL_TRIS = 0;
            FINT_TRIS = 1;
            
            nFSEL = 1;     
        #elif defined(MRF24J40)
            PHY_WAKE_TRIS = 0;
            PHY_WAKE = 1;
        #else                
            Data_nCS_TRIS = 0;
            Config_nCS_TRIS = 0;
            Data_nCS = 1;   
            Config_nCS = 1;
            IRQ1_INT_TRIS = 1;
            IRQ0_INT_TRIS = 1;
        
        #endif

#if defined (MRF89XA)
            #if(!defined(__PIC32MX__))
                INTCON2bits.INT1EP = 0;
                INTCON2bits.INT2EP = 0;
                
                IPC7bits.INT2IP2 = 1;
                IPC7bits.INT2IP1 = 0;
                IPC7bits.INT2IP0 = 0;
                                    
                IPC5bits.INT1IP2 = 1;
                IPC5bits.INT1IP1 = 0;
                IPC5bits.INT1IP0 = 0;
            #endif                    
        #else
            #if(!defined(__PIC32MX__))
                INTCON2bits.INT1EP = 1;
            #endif
        #endif
        
        // Make RB0 as Digital input
        AD1PCFGbits.PCFG2 = 1;
        
        #if defined(ENABLE_NVM)

            EE_nCS_TRIS = 0;
            EE_nCS = 1;
        
        #endif

        #if defined(MRF89XA)
            PHY_IRQ1 = 0;
            PHY_IRQ0 = 0;
            PHY_RESETn_TRIS = 1;
        #else
            RFIF = 0;
            if( RF_INT_PIN == 0 )
            {
                RFIF = 1;
            }
            RFIE=1;
        #endif

        SPI1CON1 = 0b0000000100111101;
        SPI1STAT = 0x8000;

        SPI2CON1 = 0b0000000100111101;
        SPI2STAT = 0x8000;
        
    
        LCDInit();
}

