243-510-MA/243-510-A17/MIWI 2.0/Lib/apps/miwi/miwi_mesh/MiWi_Mesh/mesh_example_16bit/src/system_config/exp16_pic24f128ga010_24j40/system.c
    void HardwareSaveSPIBaudSetValue(uint32_t baud)
    {
    
    }
    void HardwareRestoreSPIBaud(void)
    {
    
    }

    uint8_t switches=0;
    
    void ButtonTask(void)
    {
        static Tick tStart;
        static uint8_t s0Count=0,s1Count=0;
        static uint8_t pS0=0,pS1=0;
        uint8_t Sw;
        if(TickGetDiffMs(TickGetMs(),tStart)>10)
        {
            Sw=SW0_PORT;
            if(pS0==Sw)
            {
                if(s0Count<5)
                {
                    s0Count++;
                }else
                {
                    if(pS0==0)
                    {
                        switches|=(1<<0);
                    }else
                    {
                        switches&=(~(1<<0));
                    }
                }
            }
            pS0=Sw;
            
            Sw=SW1_PORT;
            if(pS1==Sw)
            {
                if(s1Count<5)
                {
                    s1Count++;
                }else
                {
                    if(pS1==0)
                    {
                        switches|=(1<<1);
                    }else
                    {
                        switches&=(~(1<<1));
                    }
                }
            }
            pS1=Sw;
        }        
    }
    
    bool isButtonPressed(uint8_t index)
    {
        uint8_t mask=(1<<index);
        return((switches & mask)>0);
    }
#else


    void HardwareInit(void)
    {
		/*******************************************************************/
		// Primary Internal Oscillator
		/*******************************************************************/
		OSCCON = 0x78;
		OSCTUNEbits.PLLEN = 1;
		WDTCONbits.SWDTEN = 0;

		/*******************************************************************/
		// Configure PPS Related Pins
		/*******************************************************************/
		// Unlock to config PPS
		EECON2 = 0x55;
		EECON2 = 0xAA;
		PPSCONbits.IOLOCK = 0;

		RPINR1 = 17;            // Mapping IRQ1 to RC6(RP17) * Used for MRF89XA
		RPINR21 = 23;			// Mapping SDI2 to RD6(RP23)
		RPOR21 = 10;			// Mapping SCK2 to RD4(RP21)
		RPOR19 = 9;			    // Mapping SDO2 to RD2(RP19)
	
		// Lock System
		EECON2 = 0x55;
		EECON2 = 0xAA;
		PPSCONbits.IOLOCK = 1;

		/*******************************************************************/
		// AN0 & AN1 Analog Pins others Digital Pins
		/*******************************************************************/
		ANCON0 = 0xFC;
		ANCON1 = 0x1F;

		/*******************************************************************/
		// Configure Switch and LED I/O Ports
		/*******************************************************************/
		LED0_TRIS=0;
        LED1_TRIS=0;
        LED2_TRIS=0;
        /*LED_1 = 0;
		LED_2 = 0;
		LED_3 = 0;
		LED1_TRIS = 0;
		LED2_TRIS = 0;
		LED3_TRIS = 0;
            
		SW0_TRIS = 1;
		SW1_TRIS = 1;*/
							
		INTCON2bits.RBPU = 0;   // Enable PORTB Pull-ups for Switches

		/*******************************************************************/
		// Configure the Temp Sensor and VBat port
		/*******************************************************************/	
		TRISAbits.TRISA1 = 1;
		TRISAbits.TRISA0 = 1;
    
		/*******************************************************************/
		// Config RF Radio
		/*******************************************************************/
		#if defined(MRF24J40)
			/*******************************************************************/
			// Config MRF24J40 Pins
			/*******************************************************************/
			PHY_CS = 1;
			PHY_RESETn = 1;    
			PHY_WAKE = 1;
    
			PHY_CS_TRIS = 0;
			PHY_RESETn_TRIS = 0;        
			PHY_WAKE_TRIS = 0;
			RF_INT_TRIS = 1;
             
			// Config INT0 Edge = Falling
			INTCON2bits.INTEDG0 = 0;
    
			RFIF = 0;
			RFIE = 1;
    
			/*******************************************************************/
			// Confiure SPI1
			/*******************************************************************/     
			SDI_TRIS = 1;
			SDO_TRIS = 0;
			SCK_TRIS = 0;
    
			SSP1STAT = 0xC0;
			SSP1CON1 = 0x20;
   
		#elif defined(MRF89XA)
			/*******************************************************************/
			// Config MRF89XA Pins
			/*******************************************************************/ 
			Data_nCS = 1;
			Config_nCS = 1;
    
			Data_nCS_TRIS = 0; 
			Config_nCS_TRIS = 0;   
    
			IRQ0_INT_TRIS = 1;
			IRQ1_INT_TRIS = 1;
    
			// Config IRQ1 Edge = Rising
			INTCON2bits.INTEDG1 = 1;
    
			// Config IRQ0 Edge = Falling
			INTCON2bits.INTEDG0 = 1;
    
			PHY_IRQ0 = 0;           // MRF89XA
			PHY_IRQ0_En = 1;        // MRF89XA  
			PHY_IRQ1 = 0;           // MRF89XA
			PHY_IRQ1_En = 1;        // MRF89XA    
			/*******************************************************************/
			// Confiure SPI1
			/*******************************************************************/   
			SDI_TRIS = 1;
			SDO_TRIS = 0;
			SCK_TRIS = 0;
    
			SSP1STAT = 0xC0;
			SSP1CON1 = 0x22;

            /*******************************************************************/
            // Configure SPI2
            /*******************************************************************/   
            SDI2_TRIS = 1;
            SDO2_TRIS = 0;
            SCK2_TRIS = 0;
            
            RPINR1 = 17;            // Mapping IRQ1 to RC6(RP17) * Used for MRF89XA
            RPINR21 = 23;			// Mapping SDI2 to RD6(RP23)
            RPOR21 = 10;			// Mapping SCK2 to RD4(RP21)
            RPOR19 = 9;			    // Mapping SDO2 to RD2(RP19)

            SSP2STAT = 0x00;
            SSP2CON1 = 0x31;

            PIR3bits.SSP2IF = 0;
            
            
		#endif
    
		/*******************************************************************/    
		// Configure EEProm Pins
		/*******************************************************************/
		RF_EEnCS = 1;
		RF_EEnCS_TRIS = 0;
    
		/*******************************************************************/
		// Configure LCD Pins
		/*******************************************************************/
		LCD_BKLT = 0;
		LCD_CS = 1;
		LCD_RS = 0;
		LCD_RESET = 0;
		LCD_BKLT_TRIS = 0;
		LCD_CS_TRIS = 0;
		LCD_RS_TRIS = 0;
		LCD_RESET_TRIS = 0;
    
		/*******************************************************************/
		// Configure SPI2
		/*******************************************************************/   
		SDI2_TRIS = 1;
		SDO2_TRIS = 0;
		SCK2_TRIS = 0;
    
		SSP2STAT = 0x00;
		SSP2CON1 = 0x32;
        
        EE_nCS_TRIS=0;
        EE_nCS=1;
    
		PIR3bits.SSP2IF = 0; 

		/*******************************************************************/
		// Enable System Interupts
		/*******************************************************************/
		INTCONbits.GIEH = 1;
    }

