243-510-MA/243-510-A17/MIWI 2.0/Lib/apps/miwi/miwi_mesh/MiWi_Mesh/mesh_example_16bit/src/system_config/exp16_pic24f128ga010_24j40/system.c
    void HardwareSaveSPIBaudSetValue(uint32_t baud)
    {
    
    }
    void HardwareRestoreSPIBaud(void)
    {
    
    }

    uint8_t switches=0;
    
    void ButtonTask(void)
    {
        static Tick tStart;
        static uint8_t s0Count=0,s1Count=0;
        static uint8_t pS0=0,pS1=0;
        uint8_t Sw;
        if(TickGetDiffMs(TickGetMs(),tStart)>10)
        {
            Sw=SW0_PORT;
            if(pS0==Sw)
            {
                if(s0Count<5)
                {
                    s0Count++;
                }else
                {
                    if(pS0==0)
                    {
                        switches|=(1<<0);
                    }else
                    {
                        switches&=(~(1<<0));
                    }
                }
            }
            pS0=Sw;
            
            Sw=SW1_PORT;
            if(pS1==Sw)
            {
                if(s1Count<5)
                {
                    s1Count++;
                }else
                {
                    if(pS1==0)
                    {
                        switches|=(1<<1);
                    }else
                    {
                        switches&=(~(1<<1));
                    }
                }
            }
            pS1=Sw;
        }        
    }
    
    bool isButtonPressed(uint8_t index)
    {
        uint8_t mask=(1<<index);
        return((switches & mask)>0);
    }
#endif
    
//LED Manager
typedef enum LEDState_t_def
{
    LED_POR,
    LED_Off,
    LED_Blink,
    LED_DelayActive,
    LED_DelayInactive,
    LED_On,
}LEDState_t;



LEDState_t LEDState[LEDCount]={LED_POR,LED_POR};
LEDCmd_t LEDCmd[LEDCount]={lCMD_None,lCMD_None};

void LEDManagerTask(void)
{
    uint16_t i;
    static LEDState_t lNextState[LEDCount];
    static Tick tStart[LEDCount];

    for(i=0;i<LEDCount;i++)
    {
        switch(LEDState[i])
        {
            case LED_POR:
                LEDxOff(i);
                LEDState[i]=LED_Off;
                break;

            case LED_Off:
                if(LEDCmd[i]==lCMD_On)
                {
                    LEDxOn(i);
                    LEDState[i]=LED_On;
                }else if(LEDCmd[i]==lCMD_Blink)
                {
                    tStart[i]=TickGetMs();
                    LEDState[i]=LED_DelayActive;
                    lNextState[i]=LED_Off;
                    LEDxOn(i);
                }else if(LEDCmd[i]==lCMD_Toggle)
                {
                    LEDxOn(i);
                    LEDState[i]=LED_On;
                }
                LEDCmd[i]=lCMD_None;
                break;

            case LED_DelayActive:
                if(TickGetDiffMs(TickGetMs(),tStart[i])>MS(20))
                {
                    LEDState[i]=LED_DelayInactive;
                    tStart[i]=TickGetMs();
                    if(lNextState[i]==LED_Off)
                    {
                        LEDxOff(i);
                    }else
                    {
                        LEDxOn(i);
                    }
                }
                break;

            case LED_DelayInactive:
                if(TickGetDiffMs(TickGetMs(),tStart[i])>MS(20))
                {
                    LEDState[i]=lNextState[i];
                }
                break;

            case LED_On:
                if(LEDCmd[i]==lCMD_Off)
                {
                    LEDxOff(i);
                    LEDState[i]=LED_Off;
                }else if(LEDCmd[i]==lCMD_Blink)
                {
                    tStart[i]=TickGetMs();
                    LEDState[i]=LED_DelayActive;
                    lNextState[i]=LED_On;
                    LEDxOff(i);
                }else if(LEDCmd[i]==lCMD_Toggle)
                {
                    LEDxOff(i);
                    LEDState[i]=LED_Off;
                }
                LEDCmd[i]=lCMD_None;
                break;
            default:
                break;
        }
    }
}

void LEDCommand(LED_t led, LEDCmd_t cmd)
{
    if( (LEDCmd[led]!=lCMD_On) && (LEDCmd[led]!=lCMD_Off) )
    {
        LEDCmd[led]=cmd;
    }
}

void BlinkRedLED(void)
{
    LEDCommand(LEDRed,lCMD_Blink);
}
